; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
; params: miconic -f 5 -p 2 -r 991010113






(define (problem mixed-f5-p2-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 - passenger
             f0 f1 f2 f3 f4 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)

(above f1 f2)
(above f1 f3)
(above f1 f4)

(above f2 f3)
(above f2 f4)

(above f3 f4)



(origin p0 f1)
(destin p0 f3)

(origin p1 f2)
(destin p1 f4)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
))
)

; plan
1. (up f0 f4)
   deleted: (lift-at f0)
   added: (lift-at f4)
   goals met: 0 of 2
2. (down f4 f2)
   deleted: (lift-at f4)
   added: (lift-at f2)
   goals met: 0 of 2
3. (board f2 p1)
   added: (boarded p1)
   goals met: 0 of 2
4. (up f2 f4)
   deleted: (lift-at f2)
   added: (lift-at f4)
   goals met: 0 of 2
5. (depart f4 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 2
6. (down f4 f3)
   deleted: (lift-at f4)
   added: (lift-at f3)
   goals met: 1 of 2
7. (down f3 f1)
   deleted: (lift-at f3)
   added: (lift-at f1)
   goals met: 1 of 2
8. (board f1 p0)
   added: (boarded p0)
   goals met: 1 of 2
9. (up f1 f3)
   deleted: (lift-at f1)
   added: (lift-at f3)
   goals met: 1 of 2
10. (depart f3 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 2 of 2
